Repository: OpenPecha-Data/85a2e5297d9b4d0d81a168a2327683f2
Catalog: *.po
Languages: bo

source: Ānanda, this is the last time she will be poor.
bo: ཀུན་དགའ་བོ་ འདི་ ནི་ འདི་ -འི་ དབུལ་བ་ -འི་ ཐ་མ་ ཡིན་ ཏེ་ །

source: Once born there, she will make offerings to an innumerable, immeasurable, inconceivable number of buddhas
bo: དེ་ -ར་ སྐྱེས་ ནས་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ ལ་ མཆོད་པ་ བྱེད་པ་ -ར་ འགྱུར་ །

source: Ānanda, after death, this woman, who no longer craves a woman’s faculties, will obtain a man’s faculties in the Sukhāvatī buddhafield of the bhagavān, the perfectly complete buddha Amitābha.
bo: ཀུན་དགའ་བོ་ བུད་མེད་ འདི་ ནི་ འདི་ ནས་ ཤི་འཕོས་ ནས་ བཅོམ་ལྡན་འདས་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ འོད་ དཔག་མེད་ ཀྱི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ་ ཅན་ དུ་ བུད་མེད་ ཀྱི་ དབང་པོ་ ལ་ འདོད་ཆགས་ དང་ བྲལ་ ནས་ སྐྱེས་པ་ -འི་ དབང་པོ་ ཐོབ་པ་ -ར་ གྱུར

source: guide an innumerable, immeasurable, inconceivable number of sentient beings to enlightenment
bo: སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ བྱང་ཆུབ་ ལ་ འཛུད་པ་ -ར་ འགྱུར་ །

source: make an innumerable, immeasurable, inconceivable number of sentient beings ripe for enlightenment
bo: སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ བྱང་ཆུབ་ ལ་ ཡོངས་སུ་ སྨིན་པ་ -ར་ བྱེད་པ་ -ར་ འགྱུར

source: bring an innumerable, immeasurable, inconceivable number of sentient beings to enlightenment
bo: སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ བྱང་ཆུབ་ ལ་ འགོད་པ་ -ར་ འགྱུར་ །

source: Ānanda, the wealth and enjoyments of sentient beings of this buddha field will be like those of the gods of the Thirty-Three.
bo: ཀུན་དགའ་བོ་ སུམ་ཅུ་རྩ་གསུམ་པ་ -འི་ ལྷ་ རྣམས་ ཀྱི་ ལོངས་སྤྱོད་ དང་ ། ཡོངས་སུ་ སྤྱོད་པ་ ཇི་ལྟ་བ་ བཞིན་ དུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ -འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ ལོངས་སྤྱོད་པ་ དང་ ཀུན་སྤྱོད་པ་ ། དེ་ཡང་ དེ་ དང་ འདྲ་བ་ -ར་ འགྱུར་ རོ་ །

source: and having brought an innumerable, immeasurable, inconceivable number of sentient beings to enlightenment, in six million eight hundred thousand kalpas she will become the Tathāgata, arhat, perfectly complete Buddha named Bodhyaṅga­puṣpa­kara in this trichiliocosm.
bo: སེམས་ཅན་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་ ཅིང་ བསམ་ གྱིས་ མི་ ཁྱབ་པ་ དག་ བྱང་ཆུབ་ ལ་ བཀོད་ ནས་ ད་སྟེ་ བསྐལ་པ་ བརྒྱ་ སྟོང་ཕྲག་ དྲུག་ཅུ་ རྩ་ བརྒྱད་ ན་ ། སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ་ -འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ཉིད་ དུ་ ། དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ བྱང་ཆུབ་ ཀྱི་ ཡན་ལག་ གི་ མེ་ཏོག་ བྱེད་ ཅེས་བྱ་བ་ -ར་ འགྱུར་ ཏེ

source: Ānanda, behold this old lady,
bo: རྒན་མོ་ འདི་ ལ་ ཀུན་དགའ་ ཁྱོད་ ལྟོས་ ཤིག་ །

source: Before me with palms joined
bo: ང་ ཡི་ མདུན་ ན་ ཐལ་སྦྱར་ གང་ འདུག་པ་ །

source: and having spoken these words
bo: བདེ་བ་ -ར་ གཤེགས་པ་ -ས་ དེ་སྐད་ གསུངས་ ནས་ །

source: Thus did the Bhagavān announce
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏེ་ །

source: the Sugata, the Teacher, added the following verses
bo: སྟོན་པ་ -ས་ གཞན་ ཡང་ འདི་སྐད་ བཀའ་ སྩལ་ ཏོ་ ། །

source: Who will become a buddha, excellent among humans, Named Bodhyaṅga­puṣpa­kara
bo: འདི་ ནི་ མི་ ཡི་དམ་ པ་སངས་ རྒྱས་ འགྱུར་ ། ། བྱང་ཆུབ་ ཡན་ལག་ མེ་ཏོག་ བྱེད་ ཅེས་ བྱ་ །

source: She, giving up a woman’s form
bo: འདི་ ནི་ བུད་མེད་ དངོས་པོ་ འདི་ སྤངས་ ནས་ ། །

source: Will go to the realm of Sukhāvatī.
bo: བདེ་བ་ ཅན་ གྱི་ འཇིག་རྟེན་ ཁམས་ སུ་ འགྲོ་ །

source: Venerate the victor Amitāyus
bo: རྒྱལ་བ་ ཚེ་ དཔག་མེད་ དེ་ བསྙེན་བཀུར་ ནས་ ། །

source: And become a peerless buddha, conqueror of the three realms.
bo: ཁམས་ གསུམ་ རྒྱལ་བ་ མཚུངས་མེད་ སངས་རྒྱས་ འགྱུར་ །

source: She will become a peerless buddha, excellent among humans.
bo: འདི་ ནི་ མཚུངས་མེད་ མི་མཆོག་ སངས་རྒྱས་ འགྱུར་ །

source: Venerating, too, the many guides Who dwell in other worlds, The great sages who benefit those realms
bo: འཇིག་རྟེན་ ཁམས་ གཞན་དག་ ན་ གང་ བཞུགས་པ་ ། ། དྲང་སྲོང་ ཆེན་པོ་ འཇིག་རྟེན་ དོན་ མཛད་པ་ ། ། རྣམ་འདྲེན་ དེ་དག་ ལ་ ཡང་ བསྙེན་བཀུར་ ནས་ །

source: Having also heard the Dharma from them all
bo: དེ་དག་ ཀུན་ ལས་ ཆོས་ ཀྱང་ ཐོས་ གྱུར་ ནས་ །

source: With a purified mind, she will become accomplished in the same fashion.
bo: བསམ་པ་ དག་པ་ -ས་ དེ་བཞིན་ འགྲུབ་པ་ -ར་ འགྱུར་ །

source: Remaining in the immovable, supreme mind of enlightenment
bo: བྱང་ཆུབ་ སེམས་ མཆོག་ མི་ བསྐྱོད་ གནས་ ནས་ ནི་ །

source: She will cause‌ countless sentient beings to practice the Dharma.
bo: སེམས་ཅན་ དཔག་མེད་ ཆོས་ ལ་ སྤྱོད་པ་ -ར་ བྱེད་ །

source: At that time there will be no inferior beings
bo: དེ་ ཡི་ ཚེ་ ན་ གང་དག་ དམན་པ་

source: No beings with various bad bodies or bad color
bo: སྣ་ཚོགས་ ལུས་ དང་ཁ་ དོག་ ངན་པ་

source: None dull, lame, and likewise none blind, And no lepers with stumps for arms.
bo: རྨོངས་ དང་ འཐེང་པོ་ དེ་བཞིན་ ཞར་བ་ དང་ ། ། ལག་རྡུམ་ མཛེ་ ཅན་ དེ་དག་ འབྱུང་ མི་ འགྱུར་ །

source: At that time the sun and moon, fire, lightning, and gems Will no longer be what shines
bo: ཉི་ཟླ་ མེ་ དང་ གློག་ དང་ ནོར་བུ་ རྣམས་ ། ། དེ་དག་ འོད་ ནི་ དེ་ ཚེ་ འབྱུང་ མི་ འགྱུར་ །

source: For the guide Bodhyaṅga­puṣpa­kara’s mighty light Will everywhere be all-illuminating.
bo: རྣམ་འདྲེན་ བྱང་ཆུབ་ ཡན་ལག་ མེ་ཏོག་ གི་ ། ། ཐུབ་པ་ -འི་ འོད་ ཀྱིས་ ཀུན་ དུ་ གསལ་བ་ -ར་ ཁྱབ་ །

source: There will be no women belonging to Māra’s faction
bo: དེ་ ན་ བུད་མེད་ བདུད་ ཀྱི་ རིས་ ཀྱང་ མེད་ །

source: No female māras, no retinue of Māra.
bo: བདུད་ ཀྱི་ བུད་མེད་ བདུད་ ཀྱི་ ཕྱག་བརྙན་ མེད་ །

source: The same stature, marks, and complexion As those of the supreme gods of the Thirty-Three Will be natural to those beings who at that time Will fill that exceptional buddhafield.
bo: སུམ་ཅུ་རྩ་གསུམ་ ལྷ་ མཆོག་ རྣམས་ ཀྱི་ ནི་ ། ། ཆུ་ཞེང་ རྟགས་ དང་ཁ་ དོག་ ཅི་འདྲ་བ་ ། ། དེ་ འདྲ་ -འི་ རང་བཞིན་ ཅན་ གྱི་ སྐྱེ་བོ་ ཡིས་ ། ། དེ་ ཚེ་ མ་སྨད་ ཞིང་ ནི་ གང་བ་ -ར་ འགྱུར་ །

source: When the Tathāgata teaches the Dharma there
bo: བདེ་བ་ -ར་ གཤེགས་པ་ དེ་ ན་ ཆོས་སྟོན་ ཚེ་ །

source: Even the word ‘tīrthika’ will be unknown
bo: དེ་ ན་ མུ་སྟེགས་ ཅན་ གྱི་ མིང་ མི་ གྲགས་ ། །

source: Even the words ‘the lower realms,’ ‘The pretas,’ ‘animal birth,’ ‘the beings of hell,’ And even the word ‘woman,’ will ever stay unheard.
bo: དེ་དུས་ ཡི་དགས་ དུད་འགྲོ་ -འི་ སྐྱེས་ གནས་ དང་ ། ། སེམས་ དམྱལ་ ངན་སོང་ རྣམས་ ཀྱི་ མིང་ མི་ གྲགས་ ། ། དེ་ ན་ བུད་མེད་ མིང་ ཡང་ གྲགས་ མི་ འགྱུར་ །

source: All will be endowed with a complete mind of enlightenment
bo: ཀུན་ ཀྱང་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ སེམས་ དང་ ལྡན་ །

source: At that time, there will be no classifications of vehicles, Like the vehicles of the śrāvakas and the pratyekabuddhas in this world
bo: འདི་ ན་ ཉན་ཐོས་ རྐྱེན་ གྱི་ ཐེག་པ་ ལྟར་ ། ། དེ་ ཚེ་ ཐེག་པ་ རྣམ་པ་ -ར་ གཞག་པ་ མེད་ །

source: This completes the Noble Mahāyāna Sūtra, “The Questions of an Old Lady.”
bo: འཕགས་པ་ བགྲེས་མོ་ -ས་ ཞུས་པ་ ཞེས་ བྱ་བ་ ཐེག་པ་ ཆེན་པོ་ -འི་ མདོ་ རྫོགས་ སོ་ །

source: The translation was made, edited, and approved by the Indian preceptors Jinamitra and Dānaśīla and the chief editor and translator Bandé Yeshé Dé.
bo: རྒྱ་གར་ གྱི་ མཁན་པོ་ ཛི་ན་མི་ཏྲ་ དང་ ། དཱ་ ན་ ཤཱི་ ལ་ དང་ ། ཞུ་ཆེན་ གྱི་ ལོཙྪ་བ་ བན་དེ་ ཡེ་ཤེས་ སྡེ་ -ས་ བསྒྱུར་ ཅིང་ ཞུས་ ཏེ་ གཏན་ ལ་ ཕབ་པ་ །

source: Dwell in loving-kindness, and be compassionate.
bo: དེ་དག་ བྱམས་ ལ་ གནས་ ཤིང་ སྙིང་རྗེ་ ཅན་ །

source: As birth in that buddhafield will always be miraculous, Everyone there will be free from birth in the womb.
bo: ཞིང་ དེ་ -ར་ མི་ རྣམས་ ཐམས་ཅད་ རྟག་པ་ -ར་ ཡང་ ། ། བརྫུས་ ཤིང་ སྐྱེས་ ཏེ་ མངལ་ ལས་ རྣམ་པ་ -ར་ ཐར་ །

source: They will remember past lives and, supremely intelligent and learned, Retain on hearing it whatever excellent teachings they study.
bo: སྐྱེ་ དྲན་ བློ་ མཆོག་ལྡན་ ཤིང་ མཁས་པ་ སྟེ་ ། ། ལེགས་པ་ -ར་ གསུངས་པ་ ཐོས་ ནས་ ཐོས་པ་ འཛིན་ ། ། ཞིང་ གི་ བཀོད་ ཚུལ་ ཅི་འདྲ་ འབྱུང་འགྱུར་བ་ །

source: Such are the qualities arrayed as features of that realm That, even by speaking of them for eons at a time, The tiny fraction of them one could thus describe Would be less than a single drop of water compared to the ocean.
bo: ཡོན་ཏན་ བསྐལ་པ་ -ར་ འདི་ -ར་ ནི་ བརྗོད་བྱ་ -ས་ ཀྱང་ ། ། རྒྱ་མཚོ་ ལས་ ནི་ ཆུ་ཐིགས་ གཅིག་ ལྟ་བུ་ -ར་ ། ། དཔེ་ཙམ་ དུ་ ཡང་ བརྗོད་པ་ -ར་ མི་ འགྱུར་ རོ་ །

source: When the Bhagavān had spoken
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་སྐད་ ཅེས་ བཀའ་ སྩལ་ ནས་ །

source: the venerable Ānanda and the old lady
bo: ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་བོ་ དང་ ། རྒན་མོ་ དེ་

source: the bodhisattvas and bhikṣus
bo: བྱང་ཆུབ་ སེམས་དཔའ་ དེ་དག་ དང་ ། དགེ་སློང་ དེ་དག་

source: the world with its gods, humans, demigods and gandharvas all rejoiced
bo: ལྷ་ དང་ ། མི་ དང་ ། ལྷ་མ་ ཡིན་ དང་ ། དྲི་ཟ་ -ར་ བཅས་པ་ -འི་ འཇིག་རྟེན་ ཡི་ རངས

source: praised highly what the Bhagavān had taught
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ གསུངས་པ་ ལ་ མངོན་པར་ བསྟོད་ དོ་ །

source: with complete limbs, parts of limbs and all the sense faculties.
bo: དེ་དག་ ཡན་ལག་ དང་ ། ཉིང་ལག་ དང་ ། དབང་པོ་ ཐམས་ཅད་ མ་ཚང་བ་ མེད་པ་ -ར་

source: Well executed though the painting may be, it does not involve any phenomenon at all being transferred from the artist’s hand or mind to the physical form depicted; and yet we designate that form as a result of those conditions.
bo: མངོན་པར་ སྒྲུབ་པ་ -ར་ བྱེད་ ཀྱང་ ། དེ་ ལ་ ཆོས་ གང་ཡང་ རི་མོ་ མཁན་ གྱི་ ལག་པ་ -འམ་ ། སེམས་ལས་ གཟུགས་ སུ་ འཕོས་པ་ མེད་ མོད་ ཀྱི་ ། འོན་ཀྱང་ དེ་ -འི་ རྐྱེན་ གྱིས་ གཟུགས་ འདོགས་ ཏེ་ །

source: When the hills and valleys are quenched, the rain later subsides.
bo: སྒང་ དང་ གཤོངས་ ངོམས་པ་ -ར་ བྱས་ ནས་ ། སླར་ འགྲོ་ ཡང་

source: But these things do not originate from the nāgas’ bodies or minds.
bo: དེ་དག་ ཀླུ་ -འི་ ལུས་ སམ་ སེམས་ལས་ བྱུང་བ་ ཡང་ མེད་ མོད་ ཀྱི་ །

source: The nāgas produced the vast gathering of clouds by virtue of the nāga-powers of nāgas alone.
bo: ཀླུ་ རྣམས་ ཀྱིས་ ཀླུ་ -འི་ མཐུ་ ཉིད་ ཀྱིས་ སྤྲིན་ གྱི་ ཚོགས་ རྒྱ་ཆེན་པོ་ འབྱུང་ ངོ་ །
