Repository: OpenPecha-Data/85a2e5297d9b4d0d81a168a2327683f2
Catalog: *.po
Languages: bo

source: Homage to all buddhas and bodhisattvas.
bo: སངས་རྒྱས་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ་ །

source: Thus did I hear at one time.
bo: འདི་སྐད་ བདག་ གིས་ ཐོས་པ་ དུས་ གཅིག་ ན་ །

source: When the Bhagavān was traveling in the land of Vṛji, he went to the great city of Vaiśālī, together with a large saṅgha of one thousand two hundred and fifty bhikṣus and a vast number of bodhisattva mahāsattvas.
bo: བཅོམ་ལྡན་འདས་ ཡུལ་ བི་ ཛི་ན་ ཡུལ་ རྒྱུ་བ་ རྒྱུ་ ཞིང་ དགེ་སློང་ སྟོང་ ཉིས་ བརྒྱ་ ལྔ་ བཅུ་ -འི་ དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རབ་ཏུ་ མང་པོ་ དང་ ཐབས་ཅིག་ ཏུ་ གྲོང་ཁྱེར་ ཆེན་པོ་ ཡངས་པ་ ཅན་ ག་ལ་བ་ དེ་ -ར་ གཤེགས་པ་ དང་ །

source: At that time, he came across an old woman from the city gathering grass in the countryside. She was decrepit and had reached the end of her life-span, being one hundred and twenty years old.
bo: དེ་ -འི་ ཚེ་ གྲོང་ གི་ བུད་མེད་ རྒན་མོ་ གཏུགས་པ་ ། འཁོགས་པ་ ། ན་ཚོད་ ལས་ འདས་པ་ -ར་ གྱུར་པ་ ། སྐྱེས་ ནས་ ལོ་ བརྒྱ་ ཉི་ཤུ་ ལོན་པ་ ཞིག་ དགོན་པ་ ན་ རྩྭ་ སྡུད་ ཅིང་ འདུག་ སྟེ་ །

source: The woman saw the Bhagavān coming from afar—handsome, inspiring, with senses tamed, mind tamed, endowed with supreme discipline and serenity, guarded, faultless, senses controlled, pure and clear like the sea, unclouded, upright like a golden sacrificial post, radiant with splendor clear and distinct, wonderfully adorned with the thirty-two signs of a great being.
bo: བུད་མེད་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ མཛེས་པ་ ། དང་བ་ -ར་ བྱེད་པ་ དབང་པོ་ དུལ་བ་ ། ཐུགས་ དུལ་བ་ ། དུལ་བ་ དང་ ཞི་གནས་ མཆོག་ བརྙེས་པ་ ། སྦས་པ་ ། སྐྱོན་མེད་པ་ ། དབང་པོ་ དུལ་བ་ ། མཚོ་ ལྟར་ དང་ ཞིང་ གསལ་ ལ་ རྙོག་པ་ མེད་པ་ ། གསེར་ གྱི་ མཆོད་སྡོང་ ལྟར་ མངོན་པར་ འཕགས་པ་ ། དཔལ་ གྱིས་ ལྷམ་ མེ་ ། ལྷན་ནེ་ ། ལྷང་ངེ་བ་ ། སྐྱེས་བུ་ ཆེན་པོ་ -འི་ མཚན་ སུམ་ཅུ་རྩ་གཉིས་ ཀྱིས་ ལེགས་པ་ -ར་ བརྒྱན་པ་ ཐག་ རིང་པོ་ ནས་ བྱོན་པ་ མཐོང་ ངོ་ །

source: bowed her head at his feet, circumambulated the Bhagavān three times and sat to one side. Bowing with her palms together in the direction of the Bhagavān, the woman then asked him
bo: བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ། བཅོམ་ལྡན་འདས་ ལ་ ལན་ གསུམ་ བསྐོར་བ་ བྱས་ ནས་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ སྟེ་ ། བུད་མེད་ དེ་ -ས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས་ ། བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ་ ། །

source: O Bhagavān, where does birth come from?
bo: བཅོམ་ལྡན་འདས་ སྐྱེ་བ་ གང་ ནས་ མཆིས་ །

source: Where does aging come from?
bo: རྒ་བ་ གང་ ནས་ མཆིས་ །

source: Where do they go?
bo: གང་ དུ་ མཆི་ །

source: O Bhagavān, where does sickness come from?
bo: བཅོམ་ལྡན་འདས་ ན་བ་ གང་ ནས་ མཆིས་ །

source: Where does death come from?
bo: འཆི་བ་ གང་ ནས་ མཆིས་ །

source: O Bhagavān, where does form come from?
bo: བཅོམ་ལྡན་འདས་ གཟུགས་ གང་ ནས་ མཆིས་ །

source: Where do sensation, notions, formative factors and consciousness come from?
bo: ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གང་ ནས་ མཆིས་ །

source: O Bhagavān, where does the earth element come from?
bo: བཅོམ་ལྡན་འདས་ ས་ -འི་ ཁམས་ གང་ ནས་ མཆིས་ །

source: Where do the water element, the fire element, the wind element, the space element and the element of consciousness come from?
bo: ཆུ་ -འི་ ཁམས་ དང་ ། མེ་ -འི་ ཁམས་ དང་ ། རླུང་ གི་ ཁམས་ དང་ ། ནམ་མཁའ་ -འི་ ཁམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ གང་ ནས་ མཆིས་ །

source: O Bhagavān, where does the eye come from?
bo: བཅོམ་ལྡན་འདས་ མིག་གང་ ནས་ མཆིས་ །

source: Where do the ear, the nose, the tongue, the body and the mind come from?
bo: རྣ་བ་ དང་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ དང་ ། ཡིད་ གང་ ནས་ མཆིས་ །

source: The Bhagavān replied
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: Sister, birth does not come from anywhere.
bo: སྲིང་མོ་ སྐྱེ་བ་ གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: Aging does not come from anywhere.
bo: རྒ་བ་ གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: They do not go anywhere.
bo: གང་ དུ་ ཡང་ མི་ འགྲོ་ -འོ་ །

source: Sister, sickness does not come from anywhere.
bo: སྲིང་མོ་ ན་བ་ གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: Death does not come from anywhere.
bo: འཆི་བ་ གང་ ནས་ ཀྱང་ མི་ འོང་ ། །

source: Sister, form does not come from anywhere
bo: སྲིང་མོ་ གཟུགས་ གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: Sensation, notions, formative factors and consciousness do not come from anywhere.
bo: ཚོར་བ་ དང་ ། འདུ་ཤེས་ དང་ ། འདུ་བྱེད་ རྣམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ གང་ ནས་ ཀྱང་ མི་ འོང་ ། གང་ དུའང་ མི་ འགྲོ་ -འོ་ །

source: Sister, the earth element does not come from anywhere.
bo: སྲིང་མོ་ ས་ -འི་ ཁམས་ གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: The water element, the fire element, the wind element, the space element and the element of consciousness do not come from anywhere.
bo: ཆུ་ -འི་ ཁམས་ དང་ ། མེ་ -འི་ ཁམས་ དང་ ། རླུང་ གི་ ཁམས་ དང་ ། ནམ་མཁའ་ -འི་ ཁམས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ ཁམས་ གང་ ནས་ ཀྱང་ མི་ འོང་ ། །

source: Sister, the eye does not come from anywhere.
bo: སྲིང་མོ་ མིག་གང་ ནས་ ཀྱང་ མི་ འོང་ །

source: The ear, the nose, the tongue, the body and the mind do not come from anywhere.
bo: རྣ་བ་ དང་ ། སྣ་ དང་ ། ལྕེ་ དང་ ། ལུས་ དང་ ། ཡིད་ གང་ ནས་ ཀྱང་ མི་ འོང་ ། །

source: Sister, it is as follows:
bo: སྲིང་མོ་ འདི་ལྟ་སྟེ་ །

source: as an analogy, a fire arises based on a stick to rub with, a stick to rub on, and and also a person’s effort to generate it.
bo: དཔེར་ན་ གཙུབ་ཤིང་ དང་ ། གཙུབ་སྟན་ ལ་ ཡང་ བརྟེན་ ལ་ ། དེ་ བསྐྱེད་པ་ -འི་ མི་ -འི་ རྩོལ་བ་ ལ་ ཡང་ བརྟེན་ ན་ མེ་ འབྱུང་ སྟེ་ །

source: That fire, moreover, once it has burnt the grass and wood, will have no more causes and will die.
bo: མེ་ དེ་ཡང་ རྩྭ་ དང་ ཤིང་ དེ་ བསྲེགས་ ནས་ རྒྱུ་ མེད་པ་ དང་ ཤི་བ་ -ར་ འགྱུར་ རོ་ ། །

source: Sister, where do you think the fire comes from
bo: སྲིང་མོ་ འདི་ ཅི་སྙམ་ དུ་ སེམས་ ། མེ་ དེ་ གང་ ནས་ འོང་ །

source: where does it go?
bo: གང་ དུ་ སོང་ །

source: She answered
bo: གསོལ་པ་ །

source: O Bhagavān, that fire comes into being owing to the power of a collection of causes.
bo: བཅོམ་ལྡན་འདས་ ཞུགས་ དེ་ ནི་ ཚོགས་པ་ -འི་ དབང་ གིས་ བྱུང་ །

source: It ceases and dies when it lacks the collection of causes.
bo: ཚོགས་པ་ དང་ བྲལ་བ་ -ས་ འགག་ -ས་ ཏེ་ འགུམ་ མོ་ ། །

source: The Bhagavān said
bo: བཀའ་ སྩལ་པ་ །

source: Sister, likewise, all phenomena come into being owing to the power of a collection.
bo: སྲིང་མོ་ དེ་བཞིན་ དུ་ ཆོས་ ཐམས་ཅད་ ཀྱང་ ཚོགས་པ་ -འི་ དབང་ གིས་ འབྱུང་ །

source: Sister, likewise, all phenomena come into being owing to the power of a collection.
bo: སྲིང་མོ་ དེ་བཞིན་ དུ་ ཆོས་ ཐམས་ཅད་ ཀྱང་ ཚོགས་པ་ -འི་ དབང་ གིས་ འབྱུང་ །

source: They cease and die when they lack the collection.
bo: ཚོགས་པ་ དང་ བྲལ་བ་ -ས་ འགག་ -ས་ ཏེ་ །

source: Whatever the phenomena, they do not come from anywhere, nor do they go anywhere.
bo: འདི་ ལ་ ཆོས་ གང་ཡང་ གང་ ནས་ ཀྱང་ འོང་བ་ -འམ་ ། གང་ དུ་ ཡང་ འགྲོ་བ་ མེད་ དོ་ ། །

source: Sister, it is as follows
bo: སྲིང་མོ་ འདི་ལྟ་སྟེ་ །

source: although the eye consciousness arises based upon the eye and form
bo: མིག་ དང་ གཟུགས་ ལ་ བརྟེན་ ནས་ །

source: the eye consciousness does not have a producer
bo: མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ བྱུང་ ཡང་མིག་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ དེ་ ལ་ སྐྱེད་པ་ -ར་ བྱེད་པ་ ཡང་ མེད་ །

source: nor has it anything that makes it cease.
bo: འགགས་པ་ -ར་ བྱེད་པ་ ཡང་ མེད་ །

source: Nowhere is it brought together at all.
bo: གང་ དུ་ ཡང་ སོགས་པ་ མེད་ །

source: The aggregates do not come from anywhere
bo: ཕུང་པོ་ གང་ ལས་ ཀྱང་ འོང་བ་ -འམ་ །

source: nor do they go anywhere
bo: འགྲོ་བ་ ཡང་ མེད་ ལ་ །

source: When one has accumulated karma through the conditions of the consciousnesses
bo: གང་ གི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ རྐྱེན་ གྱིས་ ལས་ མངོན་པར་ འདུས་བྱས་ ནས་

source: the fruits manifest as the results of three types in the three realms
bo: ཁམས་ གསུམ་ དུ་ འབྲས་བུ་ རྣམ་པ་ གསུམ་ གྱིས་ འབྲས་བུ་ ཉེ་བར་ སྟོན་ ཏེ་ །

source: That fruit is empty too
bo: འབྲས་བུ་ དེ་ཡང་ སྟོང་པ་ །

source: It has no going.
bo: འགྲོ་བ་ མེད་པ་ །

source: It has no coming.
bo: འོང་བ་ མེད་པ་ །

source: No one makes it arise.
bo: སུ་ -ས་ ཀྱང་ མ་ བསྐྱེད་པ་ །

source: It is not stopped by anybody.
bo: སུ་ -ས་ ཀྱང་ མ་ བཀག་པ་ སྟེ་ །

source: Sister, all phenomena are inherently stopped.
bo: སྲིང་མོ་ ཆོས་ ཐམས་ཅད་ ནི་ རང་བཞིན་ གྱིས་ འགགས་པ་ -འོ་ ། །

source: Likewise, although the mental consciousness arises based upon the ear and sound, the nose and smell, the tongue and taste, the body and touch, and the mind and phenomena, the mental consciousness does not have a producer
bo: དེ་བཞིན་ དུ་ རྣ་བ་ དང་ ། སྒྲ་ དང་ ། སྣ་ དང་ ། དྲི་ དང་ ། ལྕེ་ དང་ ། རོ་ དང་ ། ལུས་ དང་ ། རེག་བྱ་ དང་ ། ཡིད་ དང་ ། ཆོས་ རྣམས་ ལ་ རྟེན་ ནས་ ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ བྱུང་ ཡང་ ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ དེ་ ལ་ སྐྱེད་པ་ -ར་ བྱེད་པ་ ཡང་ མེད་ །

source: When one has accumulated karma through the condition of mental consciousness, the fruits manifest as the results of three types in the three realms.
bo: ཡིད་ ཀྱི་ རྣམ་པ་ -ར་ ཤེས་པ་ -འི་ རྐྱེན་ གྱིས་ ལས་ མངོན་པར་ འདུ་ བྱས་ ནས་ ཁམས་ གསུམ་ དུ་ འབྲས་བུ་ རྣམ་པ་ གསུམ་ གྱིས་ འབྲས་བུ་ ཉེ་བར་ སྟོན་ ཏེ་ །

source: That fruit is empty too. It has no coming. It has no going. No one makes it arise. It is not stopped by anybody.
bo: འབྲས་བུ་ དེ་ཡང་ སྟོང་པ་ འོང་བ་ མེད་པ་ འགྲོ་བ་ མེད་པ་ ། སུ་ -ས་ ཀྱང་ མ་ བསྐྱེད་པ་ ། སུ་ -ས་ ཀྱང་ མ་ བཀག་པ་ སྟེ་ ། །

source: Sister, it is as follows
bo: སྲིང་མོ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ །

source: nor does it dwell in the stick
bo: དབྱུག་ གུ་ ལ་ ཡང་ མི་ གནས་ །

source: neither does it dwell in the hide
bo: པགས་པ་ ལ་ ཡང་ མི་ གནས་ །

source: The sound does not dwell in the wood
bo: སྒྲ་ ནི་ ཤིང་ ལ་ ཡང་ མི་ གནས་ །

source: sound of a drum arises based on wood, hide and a stick, and also on a person’s effort to make it arise.
bo: ཤིང་ དང་ ། པགས་པ་ དང་ ། དབྱུག་ གུ་ ལ་ ཡང་ བརྟེན་ ། དེ་ སྐྱེད་པ་ -འི་ མི་ -འི་ རྩོལ་བ་ ལ་ ཡང་ བརྟེན་ ནས་ རྔ་ -འི་ སྒྲ་ འབྱུང་ སྟེ་ ། རྔ་ -འི་ སྒྲ་ དེ་

source: The past sound of that drum was empty, the future sound will be empty and the sound that arises at present is empty
bo: འདས་པ་ ཡང་ སྟོང་ ། མ་འོངས་པ་ ཡང་ སྟོང་ ། ད་ལྟར་ བྱུང་བ་ ཡང་ སྟོང་ སྟེ་ །

source: nor does it dwell in the person’s hand.
bo: མི་ -འི་ ལག་པ་ ལ་ ཡང་ མི་ གནས་ མོད་ ཀྱི་ །

source: However, because of these conditions, it is termed sound.
bo: འོན་ཀྱང་ དེ་ -འི་ རྐྱེན་ གྱིས་ སྒྲ་ འདོགས་ ཏེ་ །

source: That which is termed sound is also empty.
bo: གང་སྒྲ་ དེ་ འདོགས་པ་ དེ་ཡང་ སྟོང་པ་ །

source: It has no coming.
bo: འོང་བ་ མེད་པ་ ། །

source: Sister, likewise, all phenomena depend solely on conditions
bo: སྲིང་མོ་ དེ་བཞིན་ དུ་ ཆོས་ ཐམས་ཅད་ ནི་ རྐྱེན་ གྱི་ ཁོ་ན་ ལ་ རག་ ལས་པ་ སྟེ་ །

source: i.e., ones such as ignorance, craving, karma and consciousness.
bo: འདི་ལྟར་ མ་རིག་པ་ དང་ ། སྲེད་པ་ དང་ ། ལས་ དང་ ། རྣམ་པ་ -ར་ ཤེས་པ་ -འོ་ ། །

source: When these latter phenomena are present, the terms death and birth are designated.
bo: ཆོས་ དེ་དག་ ཡོད་ ན་ འཆི་ འཕོ་ དང་ ། སྐྱེ་བ་ འདོགས་ ཏེ་ །

source: That which is designated death and birth is also empty.
bo: གང་ འཆི་ འཕོ་ དང་ སྐྱེ་བ་ འདོགས་པ་ དེ་ཡང་ སྟོང་པ་ །

source: That which is designated death and birth is also empty.
bo: གང་ འཆི་ འཕོ་ དང་ སྐྱེ་བ་ འདོགས་པ་ དེ་ཡང་ སྟོང་པ་ །

source: It has no coming. It has no going. No one makes it arise. It is not stopped by anybody.
bo: འོང་བ་ མེད་པ་ ། འགྲོ་བ་ མེད་པ་ ། སུ་ -ས་ ཀྱང་ མ་ བསྐྱེད་པ་ ། སུ་ -ས་ ཀྱང་ མ་ བཀག་པ་ སྟེ་ །

source: Sister, all phenomena are inherently stopped.
bo: སྲིང་མོ་ ཆོས་ ཐམས་ཅད་ ནི་ རང་བཞིན་ གྱིས་ འགགས་པ་ -འོ་ ། །

source: Sister, in this way, whoever understands the nature of a drum’s sound well also understands emptiness well.
bo: སྲིང་མོ་ དེ་ལྟར་ སུ་ -ས་ རྔ་སྒྲ་ -འི་ ཚུལ་ རབ་ཏུ་ ཤེས་པ་ དེ་ -ས་ སྟོང་པ་ཉིད་ རབ་ཏུ་ ཤེས་ སོ་ ། །

source: Whoever understands emptiness well, understands nirvāṇa well.
bo: སུ་ -ས་ སྟོང་པ་ཉིད་ རབ་ཏུ་ ཤེས་པ་ དེ་ -ས་ མྱ་ངན་ ལས་ འདས་པ་ རབ་ཏུ་ ཤེས་ སོ་ ། །

source: Whoever understands nirvāṇa well
bo: སུ་ -ས་ མྱ་ངན་ ལས་ འདས་པ་ རབ་ཏུ་ ཤེས་པ་ དེ་ །

source: has no attachment to any entity, and despite designating conventional things with all sorts of terms
bo: ཐ་སྙད་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ ཐ་སྙད་ འདོགས་ ཀྱང་ དངོས་པོ་ གང་ ལ་ ཡང་ མངོན་པར་ ཞེན་པ་ མེད་ དེ་ །

source: ‘this is mine,’ or ‘that is me,’
bo: བདག་ གི་ འདི་ དང་ ། དེ་ ནི་ བདག་ གོ་ ཞེ་ -འམ་ །

source: or ‘sentient being,’ or ‘life force,’ or ‘living being,’ or ‘man,’ or ‘person,’
bo: སེམས་ཅན་ ནོ་ ཞེ་ -འམ་ ། སྲོག་ གོ་ ཞེ་ -འམ་ ། གསོ་བ་ -འོ་ ཞེ་ -འམ་ ། སྐྱེས་བུ་ -འོ་ ཞེ་ -འམ་ ། གང་ཟག་ གོ་ ཞེ་ -འམ་ །

source: or ‘born of Manu,’ or ‘son of Manu,’
bo: ཤེད་ ལས་ སྐྱེས་ སོ་ ཞེ་ -འམ་ ། ཤེད་བུ་ -འོ་ ཞེ་ -འམ

source: or ‘agent,’ or ‘inciter of action,’ or ‘appropriator,’
bo: བྱེད་པ་པོ་ ཞེ་ -འམ་ ། བྱེད་ དུ་ འཇུག་པ་པོ་ ཞེ་ -འམ་ ། ལེན་པ་པོ་ ཞེ་ -འམ་ །

source: or ‘discarder’—he teaches Dharma without attachment to these.
bo: འདོར་བ་པོ་ ཞེས་ དེ་ མངོན་པར་ ཞེན་པ་ མེད་པ་ -ར་ ཆོས་སྟོན་ །

source: He teaches Dharma well.
bo: ཆོས་ རབ་ཏུ་ སྟོན་ །

source: He teaches the final reality. He teaches the final reality well.
bo: ཡང་དག་པ་ -འི་ མཐའ་ སྟོན་ ། ཡང་དག་པ་ -འི་ མཐའ་ རབ་ཏུ་ སྟོན་ ཏོ་ ། །

source: Sister, it is as follows: an artist or an artist’s apprentice spreads various paints on a canvas that has been thoroughly cleaned
bo: སྲིང་མོ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ རི་མོ་ མཁན་ ནམ་ ། རི་མོ་ མཁན་ གྱི་ སློབ་མ་ ཞིག་ གིས་ རས་ བཅོས་མ་ ཤིན་ཏུ་ ཕྱི་བདར་ བྱས་པ་ -འམ་ །

source: or on a flat piece of wood or on the surface of a wall that has been wiped clean.
bo: ཤིང་ལེབ་ བམ་ ། རྩིག་ངོས་ ཤིན་ཏུ་ ཕྱི་བདར་ བྱས་པ་

source: He paints with ease whatever bodily shape he might wish
bo: ཞིག་ ལ་ ཚོན་ སྣ་ཚོགས་ འགྱེད་ ཅིང་ གཟུགས་ ཀྱི་ རྣམ་པ་ གང་དང་གང་ འདོད་པ་ འདི་ལྟ་སྟེ་ །

source: such as the features of a man’s physical form
bo: སྐྱེས་པ་ -འི་ གཟུགས་ ཀྱི་ རྣམ་པ་ -འམ་ །

source: the features of a woman’s physical form
bo: བུད་མེད་ ཀྱི་ གཟུགས་ ཀྱི་ རྣམ་པ་ -འམ་ །

source: the features of an elephant’s physical form
bo: གླང་པོ་ཆེ་ -འི་ གཟུགས་ ཀྱི་ རྣམ་པ་ -འམ་ །

source: the features of a horse’s physical form
bo: རྟ་ -འི་ གཟུགས་ ཀྱི་ རྣམ་པ་ -འམ་ །

source: or the features of a donkey’s physical form
bo: བོང་བུ་ -འི་ གཟུགས་ ཀྱི་ རྣམ་པ་ -འམ་ །

source: That which is designated form is also empty.
bo: གང་ གཟུགས་ འདོགས་པ་ དེ་ཡང་ སྟོང་པ་ །

source: Sister, all phenomena are inherently stopped.
bo: སྲིང་མོ་ ཆོས་ ཐམས་ཅད་ ནི་ རང་བཞིན་ གྱིས་ འགགས་པ་ -འོ་ ། །

source: Sister, it is likewise when there are meritorious formative factors.
bo: སྲིང་མོ་ དེ་བཞིན་ དུ་ བསོད་ནམས་ སུ་ ཉེ་བར་ འགྲོ་བ་ -འི་ མངོན་པར་ འདུ་བྱེད་པ་ རྣམས་ ཡོད་ ན་

source: That is to say, although bodies conducive to merit might result amongst gods and humans,
bo: འདི་ལྟ་སྟེ་ ལྷ་ -འམ་ མི་ -འི་ ནང་ དུ་ བསོད་ནམས་ སུ་ ཉེ་བར་ འགྲོ་བ་ -འི་ ལུས་ མངོན་པར་ གྲུབ་

source: in that case not even an atom is transferred from this world to the world beyond.
bo: ཀྱང་ དེ་ ལ་ གང་ འཇིག་རྟེན་ འདི་ ནས་ འཇིག་རྟེན་ ཕ་རོལ་ ཏུ་ འཕོ་བ་ ནི་ རྡུལ་ ཙམ་ ཡང་ མེད་

source: However, due to the formative factors, there are various kinds of rebirths.
bo: མོད་ ཀྱི་ འོན་ཀྱང་ མངོན་པར་ འདུ་བྱེད་པ་ -འི་ རྐྱེན་ གྱིས་ སྐྱེ་བ་ སྣ་ཚོགས་ ཡོད་ དེ་ །

source: They are represented as physical bodies with their bases of cognition.
bo: སྐྱེ་མཆེད་ ཡོད་པ་ -འི་ ལུས་ སུ་ རྣམ་པ་ -ར་ རིག་ གོ་ །

source: It is likewise when there are demeritorious formative factors.
bo: དེ་བཞིན་ དུ་ བསོད་ནམས་ མ་ཡིན་པ་ -ར་ ཉེ་བར་ འགྲོ་བ་ -འི་ འདུ་བྱེད་ རྣམས་ ཡོད་ ན་

source: not even an atom is transferred in such a case from this world to the world beyond.
bo: ཀྱང་ དེ་ ལ་ གང་ འཇིག་རྟེན་ འདི་ ནས་ འཇིག་རྟེན་ ཕ་རོལ་ ཏུ་ འཕོ་བ་ ནི་ རྡུལ་ ཙམ་ ཡང་ མེད་ མོད་ ཀྱི་ །

source: However, due to the formative factors there are various kinds of rebirths.
bo: འོན་ཀྱང་ མངོན་པར་ འདུ་བྱེད་པ་ -འི་ རྐྱེན་ གྱིས་ སྐྱེ་བ་ སྣ་ཚོགས་ ཡོད་ དེ་ །

source: They are understood to be physical forms with their bases of cognition.
bo: སྐྱེ་མཆེད་ ཡོད་པ་ -ས་ ལུས་ སུ་ རྣམ་པ་ -ར་ རིག་ གོ་ ། །

source: Sister, it is as follows: as an analogy, a vast gathering of clouds arises because of the nāga-power of the nāgas
bo: སྲིང་མོ་ འདི་ལྟ་སྟེ་ དཔེར་ན་ ཀླུ་ རྣམས་ ཀྱི་ ཀླུ་ -འི་ མཐུ་ -ས་ སྤྲིན་ གྱི་ ཚོགས་ རྒྱ་ཆེན་པོ་ འབྱུང་ སྟེ་ །

source: and when those huge nets of clouds cover the earth they let fall a heavy deluge of rain
bo: སྤྲིན་ གྱི་ དྲ་བ་ དེ་དག་ གིས་ ས་ ཁེབས་པ་ -ར་ བྱས་ ནས་ ཆ་ -ར་ ཆེན་པོ་ རྒྱ་ ཆེ་ -ར་ འབེབས་ ཏེ་ །

source: After the heavy deluge of rain has fallen, the hills and the valleys are quenched.
bo: ཆ་ -ར་ ཆེན་པོ་ རྒྱ་ ཆེ་ -ར་ ཕབ་ ནས་ ཀྱང་ སྒང་ དང་ གཤོངས་ ངོམས་པ་ -ར་ བྱེད་ དེ་ ། །

source: Sister, it is likewise when there are meritorious formative factors
bo: སྲིང་མོ་ དེ་བཞིན་ དུ་ བསོད་ནམས་ སུ་ ཉེ་བར་ འགྲོ་བ་ -འི་ མངོན་པར་ འདུ་བྱེད་པ་ ཡོད་ ན

source: that is to say, when meritorious bodies result amongst gods or humans.
bo: འདི་ལྟ་སྟེ་ ། ལྷ་ -འམ་ མི་ -འི་ ནང་ དུ་ བསོད་ནམས་ སུ་ ཉེ་བར་ འགྲོ་བ་ -འི་ ལུས་ རྣམས་ མངོན་པར་ འགྲུབ་བོ་ །

source: That is to say, although bodies that are not meritorious result amongst hell beings, or in the animal state, or in the world of the Lord of Death, or among the demigods,
bo: འདི་ལྟ་སྟེ་ ། སེམས་ཅན་ དམྱལ་བ་ -འམ་ ། དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སམ་ ། གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་ ནམ་ ། ལྷ་མ་ ཡིན་ རྣམས་ སུ་ བསོད་ནམས་ མ་ཡིན་པ་ -འི་ ལུས་ མངོན་པར་ འགྲུབ་

source: It is likewise, too, when there are demeritorious formative factors.
bo: དེ་བཞིན་ དུ་ བསོད་ནམས་ མ་ཡིན་པ་ -ར་ ཉེ་བར་ འགྲོ་བ་ -འི་ མངོན་པར་ འདུ་བྱེད་པ་ རྣམས་ ཡོད་ ན་

source: When she saw him, faith grew in her mind. Then full of devotion she approached the Bhagavān,
bo: མཐོང་ ནས་ ཀྱང་ སེམས་ དད་པ་ -ར་ གྱུར་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ དད་པ་ -འི་ སེམས་ ཀྱིས་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེ་ -ར་ སོང་ སྟེ་ ཕྱིན་ ནས་ ། བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ །

source: That is to say, although bodies that are not meritorious result amongst hells beings or in the animal state or the world of the Lord of Death or among the demigods,
bo: འདི་ལྟ་སྟེ་ སེམས་ཅན་ དམྱལ་བ་ -འམ་ ། དུད་འགྲོ་ -འི་ སྐྱེ་གནས་ སམ་ ། གཤིན་རྗེ་ -འི་ འཇིག་རྟེན་ ནམ་ ། ལྷ་མ་ ཡིན་ རྣམས་ སུ་ བསོད་ནམས་ མ་ཡིན་པ་ -ར་ ཉེ་བར་ འགྲོ་བ་ -འི་ ལུས་ མངོན་པར་ འགྲུབ་

source: in such cases the activity of the formative factor is empty, the agent of the formative factor is empty and the fruits of the formative factor are also empty.
bo: ཀྱང་ དེ་ ལ་ མངོན་པར་ འདུ་ བྱ་བ་ ཡང་ སྟོང་པ་ ། མངོན་པར་ འདུ་བྱེད་པ་ པོ་ ཡང་ སྟོང་པ་ ། མངོན་པར་ འདུ་བྱེད་པ་ -འི་ འབྲས་བུ་ ཡང་ སྟོང་པ་ -འོ་ ། །

source: Why is this so?
bo: དེ་ ཅིའི་ཕྱིར་ ཞེ་ན་ །

source: and the consciousness which reincarnates amongst the beings of the formless realms is empty too
bo: གང་ རྣམ་པ་ -ར་ ཤེས་པ་ དེ་ གཟུགས་ མེད་པ་ རྣམས་ སུ་ མཚམས་ སྦྱོར་བ་ དེ་ཡང་ སྟོང་པ་ -འོ་ །

source: That on account of which the consciousness reincarnates amongst beings of the formless realms is empty
bo: གང་ གིས་ རྣམ་པ་ -ར་ ཤེས་པ་ དེ་ གཟུགས་ མེད་པ་ རྣམས་ སུ་ མཚམས་ སྦྱོར་བ་ དེ་ཡང་ སྟོང་པ་ །

source: Sister, when there are formative factors for remaining static, consciousness will reincarnate amongst the beings of the formless realms.
bo: སྲིང་མོ་ མི་གཡོ་བ་ -ར་ ཉེ་བར་ འགྲོ་བ་ -འི་ མངོན་པར་ འདུ་བྱེད་པ་ རྣམས་ ཡོད་ ན་ གཟུགས་ མེད་པ་ རྣམས་ སུ་ རྣམ་པ་ -ར་ ཤེས་པ་ མཚམས་ སྦྱོར་ ཏེ

source: Sister, it is because all phenomena are empty of essence.
bo: སྲིང་མོ་ ཆོས་ ཐམས་ཅད་ ནི་ ངོ་བོ་ ཉིད་ ཀྱིས་ སྟོང་པ་ -འི་ ཕྱིར་ ཏེ་ །

source: Even so phenomena are designated.
bo: འོན་ཀྱང་ ཆོས་ རྣམས་ འདོགས་ སོ་ ། །

source: The learned are not attached to them.
bo: མཁས་པ་ རྣམས་ ནི་ དེ་ ལ་ མངོན་པར་ མི་ ཞེན་ ཏེ་ །

source: As they have no attachment they do not dispute.
bo: མངོན་པར་ ཞེན་པ་ མེད་པ་ -ས་ མི་ རྩོད་ དོ་ །

source: Having no disputes is the supreme quality of the religious mendicant.
bo: རྩོད་པ་ མེད་པ་ ནི་ དགེ་སྦྱོང་ གི་ ཆོས་ ཀྱི་ མཆོག་ གོ

source: The woman said
bo: གསོལ་པ་ །

source: Since the Bhagavān has taught the profound Dharma in this way, O Bhagavān
bo: འདི་ལྟར་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཆོས་ ཟབ་མོ་ བཀའ་ སྩལ་པ་ -ས་ བཅོམ་ལྡན་འདས་

source: I have no doubts.
bo: ཐེ་ཚོམ་ མ་ མཆིས་ སོ་ །

source: I, too, have penetrated these teachings with the eye of wisdom and will never be of two minds about them again.
bo: བདག་ ཀྱང་ ཆོས་ འདི་དག་ ལ་ ཤེས་རབ་ ཀྱི་ མིག་ འཇུག་ སྟེ་ སླར་ཞིང་ ཡིད་གཉིས་ མ་ མཆིས་ ། །

source: Now I am old
bo: ད་ནི་ བདག་ རྒས་ ། །

source: O Bhagavān, earlier, as I hadn’t yet heard these teachings I did have doubts.
bo: བཅོམ་ལྡན་འདས་ བདག་ སྔོན་ ནི་ ཆོས་ འདི་དག་ མ་ ཐོས་པ་ -ས་ ཐེ་ཚོམ་ མཆིས་ སོ་ ། །

source: I am decrepit
bo: བདག་ འཁོགས་ །

source: I suffer
bo: བདག་ སྡུག་བསྔལ་ །

source: I am poor
bo: བདག་ དབུལ་ །

source: I have no protector
bo: བདག་ མགོན་ མ་ མཆིས་ ཏེ་ །

source: I have no life and yet I do not die.
bo: བདག་ མི་ འཚོ་ ཞིང་ འགུམ་ མི་ མངའ་ -འོ་ །

source: O Bhagavān, after hearing these teachings
bo: བཅོམ་ལྡན་འདས་ བདག་ གིས་ ཆོས་ འདི་ ཐོས་པ་ -ས་ འདི་ ན་

source: I am freed from the notion of a self.
bo: ཞེས་ བདག་ ཏུ་ འདུ་ཤེས་པ་ དང་ བྲལ་བ་ -ར་ གྱུར་

source: I realize that there is no aging, no poverty, no happiness, no sickness, nor is anyone ever ill, wealthy or poor at all.
bo: རྒས་པ་ -འམ་ ། དབུལ་བ་ -འམ་ ། བདེ་བ་ -འམ་ ། ནད་མ་ མཆིས་པ་ -འམ་ ། ན་བ་ -འམ་ ། ཕྱུག་པ་ -འམ་ ། དབུལ་བ་ གང་ཡང་ མ་ མཆིས་ སོ་ ། །

source: Bhagavān, why have you taught such a profound Dharma discourse as this?
bo: བཅོམ་ལྡན་འདས་ གང་ གི་ སླད་ དུ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཟབ་མོ་ འདི་ ལྟ་བུ་ བཀའ་ སྩལ་པ་ །

source: Then the Venerable Ānanda inquired of the Bhagavān
bo: དེ་ནས་ བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་ བོས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ

source: I wonder whether it is because this woman, who has investigated so well in this way, is meritorious, learned and naturally wise.
bo: དེ་ -ས་ ཀྱང་ འདི་ལྟར་ རབ་ཏུ་ བཙལ་བ་ -ས་ བུད་མེད་ འདི་ ནི་ བསོད་ནམས་ དང་ ལྡན་པ་ མཁས་པ་ ། ཤེས་རབ་ ཅན་ གྱི་ རང་བཞིན་ ཅན་ ལགས་པ་ སྙམ་ བདག་ བགྱིད་ དོ་ །

source: The Bhagavān replied
bo: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ་ །

source: Ānanda, so it is.
bo: ཀུན་དགའ་བོ་ དེ་དེ་ བཞིན་ ནོ་ །

source: Ānanda, it is indeed just as you say.
bo: ཀུན་དགའ་བོ་ ཇི་སྐད་ སྨྲས་པ་ དེ་དེ་ བཞིན་

source: This woman is meritorious, learned and naturally wise.
bo: བུད་མེད་ འདི་ ནི་ བསོད་ནམས་ དང་ ལྡན་པ་ མཁས་པ་ ། ཤེས་རབ་ ཀྱི་ རང་བཞིན་ ཅན་ ནོ་ །

source: Ānanda, this woman was my mother for five hundred lifetimes.
bo: ཀུན་དགའ་བོ་ བུད་མེད་ འདི་ ཚེ་རབས་ ལྔ་ བརྒྱ་ -འི་ བར་ དུ་ ང་ -འི་ མར་ གྱུར་

source: Ānanda, in each of those lifetimes I also generated the roots of virtue so she could attain unsurpassable and perfectly complete enlightenment.
bo: ཀུན་དགའ་བོ་ ངས་ ཚེ་རབས་ དེ་ དང་ དེ་དག་ ཏུ་ ཡང་ བུད་མེད་ འདི་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ ཏུ་ དགེ་བ་ -འི་ རྩ་བ་ བསྐྱེད་ དོ་ ། །

source: Ānanda, I cherished, revered and respected this woman greatly.
bo: ཀུན་དགའ་བོ་ ང་ བུད་མེད་ འདི་ ལ་ ཤིན་ཏུ་ ཕངས་པ་ -ར་ བྱ་བ་ དང་ ། དང་བ་ དང་ གུས་པ་ -ར་ གྱུར་ ཏོ་ །

source: Bhagavān, why is she so poor in this way?
bo: བཅོམ་ལྡན་འདས་ འདི་ ཅིའི་སླད་དུ་ འདི་ལྟར་ དབུལ་བ་ -ར་ གྱུར་ །

source: Ānanda inquired
bo: གསོལ་པ་ །

source: She, too, thought, ‘I will engage in whatever conduct my son engages in and attain the unsurpassable and perfectly complete enlightenment of the vehicle of happiness.
bo: འདི་ ཡང་ བདག་ གི་ བུ་ སྤྱད་པ་ གང་ ལ་ སྤྱོད་པ་ -འི་ སྤྱད་པ་ དེ་ ལ་ བདག་ གིས་ ཀྱང་ སྤྱད་ དེ་ ། ཐེག་པ་ བདེ་བ་ -འི་ བླ་ ན་ མེད་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ་ -ར་ འཚང་རྒྱ་བ་ -ར་ བྱ་ -འོ་ སྙམ་ མོ་ །

source: The Bhagavān answered, “Ānanda, when I took up the conduct of a bodhisattva, I became a renunciate in the doctrine of the Bhagavān, the tathāgata, arhat, perfectly complete Buddha Krakucchanda.
bo: ཀུན་དགའ་བོ་ ང་ བྱང་ཆུབ་ སེམས་དཔའ་ -འི་ སྤྱད་པ་ སྤྱོད་པ་ ན་ གང་ གི་ ཚེ་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་པ་ -ར་ རྫོགས་པ་ -འི་ སངས་རྒྱས་ འཁོར་བ་ འཇིག་ གི་ བསྟན་པ་ ལ་ ང་ རབ་ཏུ་ བྱུང་བ་ -ར་ གྱུར་པ་

source: At that time, Ānanda, this woman was my mother.
bo: དེ་ -འི་ ཚེ་ ཀུན་དགའ་བོ་ བུད་མེད་ འདི་ ང་ -འི་ མར་ གྱུར་

source: Because of her attachment she did not want to let me go, so I stopped eating my one meal per day.
bo: དེ་ -ས་ འདོད་པ་ -ས་ ང་ མ་ བཏང་ ནས་ དེ་ -འི་ ཕྱིར་ ང་ ཟ་མ་ གཅིག་ ཟན་ བཅད་པ་

source: Later, she agreed to let me go.
bo: དེ་ -འི་ འོག་ ཏུ་ འདི་ -ས་ འདོད་པ་ -ས་ ང་ བཏང་བ་ -ར་ གྱུར་ ཏེ་ །

source: Ānanda, it is because of the ripening of that karma that she is as poor as she is.
bo: ཀུན་དགའ་བོ་ འདི་ ལས་ དེ་ -འི་ རྣམ་པ་ -ར་ སྨིན་པ་ -ས་ དེ་ལྟར་ དབུལ་བ་ -ར་ གྱུར་ ཏོ་ ། །
